Repository: jimregan/citizens-information-raw
Catalog: en-ro/www.citizensinformation.ie/ro/money_and_tax/tax/income_tax/universal_social_charge.html.txt.tmx
Source language: en
Languages: ro

source: Revenue will notify employers of the USC rates and thresholds to be applied for all employees
ro: Autoritatea fiscală va aduce la cunoștința angajatorilor ratele USC și pragurile aplicabile tuturor angajaților

source: You should inform Revenue of any changes in your circumstances (for example, if you get a medical card)
ro: (de exemplu, dacă beneficiați de un card medical) trebuie adusă la cunoștința autorității fiscale
